RT-Thread/rt-thread/bsp/apm32/libraries/APM32F10x_Library/APM32F10x_StdPeriphDriver/src/apm32f10x_adc.c
    tmp = (uint32_t)adc;
    tmp += channel;

    *(__IOM uint32_t *) tmp = (uint32_t)offSet;
}

/*!
 * @brief     Reads the ADC injected channel conversion value.
 *
 * @param     adc: Select the ADC peripheral.
 *
 * @param     channel: Select the ADC injected channel.
 *                     This parameter can be one of the following values:
 *                     @arg ADC_INJEC_CHANNEL_1: select Injected Channel 1
 *                     @arg ADC_INJEC_CHANNEL_2: select Injected Channel 2
 *                     @arg ADC_INJEC_CHANNEL_3: select Injected Channel 3
 *                     @arg ADC_INJEC_CHANNEL_4: select Injected Channel 4
 *
 * @retval    The Data of conversion value.
 *
 * @note      adc can be ADC1, ADC2 or ADC3.
 */
uint16_t ADC_ReadInjectedConversionValue(ADC_T* adc, ADC_INJEC_CHANNEL_T channel)
{
    __IOM uint32_t temp = 0;

    temp = (uint32_t)adc;
    temp += channel + INJDATA_OFFSET;

    return (uint16_t) (*(__IOM uint32_t*)  temp);
}

/*!
 * @brief        Enable the specified ADC analog watchdog.
 *
 * @param        adc: Select the ADC peripheral.
 *
 * @param        analogWatchdog: The ADC analog watchdog configuration
 *                  This parameter can be one of the following values:
 *                  @arg ADC_ANALOG_WATCHDOG_SINGLE_REG        : Analog watchdog on a single regular channel
 *                  @arg ADC_ANALOG_WATCHDOG_SINGLE_INJEC      : Analog watchdog on a single injected channel
 *                  @arg ADC_ANALOG_WATCHDOG_SINGLE_REG_INJEC  : Analog watchdog on a single regular or injected channel
 *                  @arg ADC_ANALOG_WATCHDOG_ALL_REG           : Analog watchdog on  all regular channel
 *                  @arg ADC_ANALOG_WATCHDOG_ALL_INJEC         : Analog watchdog on  all injected channel
 *                  @arg ADC_ANALOG_WATCHDOG_ALL_REG_ALL_INJEC : Analog watchdog on all regular and injected channels
 *                  @arg ADC_ANALOG_WATCHDOG_NONE              : No channel guarded by the analog watchdog
 *
 * @retval       None
 *
 * @note         adc can be ADC1, ADC2 or ADC3.
 */
void ADC_EnableAnalogWatchdog(ADC_T* adc, uint32_t analogWatchdog)
{
    adc->CTRL1 &= 0xFF3FFDFF;
    adc->CTRL1 |= analogWatchdog;
}

/*!
 * @brief        Disable the specified ADC analog watchdog.
 *
 * @param        adc: Select the ADC peripheral.
 *
 * @retval       None
 *
 * @note         adc can be ADC1, ADC2 or ADC3.
 */
void ADC_DisableAnalogWatchdog(ADC_T* adc)
{
    adc->CTRL1 &= 0xFF3FFDFF;
}

/*!
 * @brief        Configures the specified ADC high and low thresholds of the analog watchdog.
 *
 * @param        adc: Select the ADC peripheral.
 *
 * @param        highThreshold: The ADC analog watchdog High threshold value.
 *                              This parameter must be a 12bit value.
 *
 * @param        lowThreshold: The ADC analog watchdog Low threshold value.
 *                             This parameter must be a 12bit value.
 *
 * @retval       None
 *
 * @note         adc can be ADC1, ADC2 or ADC3.
 */
void ADC_ConfigAnalogWatchdogThresholds(ADC_T* adc, uint16_t highThreshold, uint16_t lowThreshold)
{
    adc->AWDHT = highThreshold;
    adc->AWDLT = lowThreshold;
}

/*!
 * @brief      Configures the specified ADC analog watchdog guarded single channel
 *
 * @param      adc: Select the ADC peripheral
 *
 * @param      channel: Select the ADC channel
 *                      This parameter can be one of the following values:
 *                        @arg ADC_Channel_0:  Select ADC Channel 0
 *                        @arg ADC_Channel_1:  Select ADC Channel 1
 *                        @arg ADC_Channel_2:  Select ADC Channel 2
 *                        @arg ADC_Channel_3:  Select ADC Channel 3
 *                        @arg ADC_Channel_4:  Select ADC Channel 4
 *                        @arg ADC_Channel_5:  Select ADC Channel 5
 *                        @arg ADC_Channel_6:  Select ADC Channel 6
 *                        @arg ADC_Channel_7:  Select ADC Channel 7
 *                        @arg ADC_Channel_8:  Select ADC Channel 8
 *                        @arg ADC_Channel_9:  Select ADC Channel 9
 *                        @arg ADC_Channel_10: Select ADC Channel 10
 *                        @arg ADC_Channel_11: Select ADC Channel 11
 *                        @arg ADC_Channel_12: Select ADC Channel 12
 *                        @arg ADC_Channel_13: Select ADC Channel 13
 *                        @arg ADC_Channel_14: Select ADC Channel 14
 *                        @arg ADC_Channel_15: Select ADC Channel 15
 *                        @arg ADC_Channel_16: Select ADC Channel 16 which is connected to TempSensor
 *                        @arg ADC_Channel_17: Select ADC Channel 17 which is connected to Vrefint
 *
 * @retval     None
 *
 * @note       adc can be ADC1, ADC2 or ADC3.
 */
void ADC_ConfigAnalogWatchdogSingleChannel(ADC_T* adc, uint8_t channel)
{
    adc->CTRL1_B.AWDCHSEL = BIT_RESET;
    adc->CTRL1 |= channel;
}

/*!
 * @brief      Enable the specified ADC temperature sensor and Vrefint channel.
 *
 * @param      adc: Select the ADC peripheral.
 *
 * @retval     None
 *
 * @note       adc can be ADC1, ADC2 or ADC3.
 */
void ADC_EnableTempSensorVrefint(ADC_T* adc)
{
    adc->CTRL2_B.TSVREFEN = BIT_SET;
}

/*!
 * @brief      Disable the specified ADC temperature sensor and Vrefint channel.
 *
 * @param      adc: Select the ADC peripheral
 *
 * @retval     None
 *
 * @note       adc can be ADC1, ADC2 or ADC3.
 */
void ADC_DisableTempSensorVrefint(ADC_T* adc)
{
    adc->CTRL2_B.TSVREFEN = BIT_RESET;
}

/*!
 * @brief      Enable the specified ADC interrupt.
 *
 * @param      adc: Select the ADC peripheral.
 *
 * @param      interrupt: Select the ADC interrupt sources
 *                        This parameter can be any combination of the following values:
 *                        @arg ADC_INT_AWD    : Enable Analog watchdog interrupt
 *                        @arg ADC_INT_EOC    : Enable End of conversion interrupt
 *                        @arg ADC_INT_INJEOC : Enable End of injected conversion interrupt
 *
 * @retval     None
 *
 * @note       adc can be ADC1, ADC2 or ADC3.
 */
void ADC_EnableInterrupt(ADC_T* adc, uint16_t interrupt)
{
    uint8_t mask;

